Repository: darxx03eh/ARABOON-Backend
Catalog: Araboon.Core/Translations/SharedTranslation.*.resx
Languages: ar

# TheUserYouWantToReplyToNotFound
source: The user you want to reply to was not found
ar: المستخدم الذي تريد الرد عليه غير موجود

# RefreshTokenWasRevoked
source: The refresh token used has already been revoked and cannot be used
ar: رمز التحديث المستخدم تم إلغاؤه مسبقًا ولا يمكن استخدامه

# RefreshTokenNotUsedAnyMore
source: The refresh token cannot be used anymore
ar: لم يعد من الممكن استخدام رمز التحديث

# RateShouldBeGreaterThanOrEqualToZero
source: The rating must be greater than or equal to zero.
ar: يجب أن يكون التقيم أكبر من أو يساوي صفر

# RateShouldBeLessThanOrEqualToFive
source: The rating must be less than or equal to five
ar: يجب أن يكون التقييم أقل من أو يساوي خمسة

# AnErrorOccurredWhileAddingTheRate
source: An error occurred while adding the rating
ar: حدث خطأ أثناء إضافة التقييم

# TheRateHasBeenAddedSuccessfully
source: The rating has been added successfully
ar: تم إضافة التقييم بنجاح

# TheRateHasBeenModifiedSuccessfully
source: The rating has been modified successfully
ar: تم تعديل التقييم بنجاح

# AnErrorOccurredWhileModifyingTheRate
source: An error occurred while modifying the rating
ar: حدث خطأ أثناء تعديل التقييم

# AnErrorOccurredDuringTheRateProcess
source: An error occurred during the rating process
ar: حدث خطأ أثناء عملية التقييم

# RateNotFound
source: Rating not found
ar: لم يتم العثور على التقييم

# ThisRateDoNotBelongToYou
source: This rating does not belong to you
ar: هذا التقييم لا يخصك

# TheRateHasBeenSuccessfullyDeleted
source: The rating has been successfully deleted
ar: تم حذف التقييم بنجاح

# AnErrorOccurredWhileDeletingTheRate
source: An error occurred while deleting the rating
ar: حدث خطأ أثناء حذف التقييم

# RateFound
source: Rating found
ar: تم العثور على التقييم

source: Chapter not found
ar: لم يتم العثور على الفصل

source: Images not found
ar: لم يتم العثور على الصور

source: Images found
ar: تم العثور على الصور

# ChapterForArabicLanguageNotExist
source: Chapter for Arabic language does not exist
ar: الفصل باللغة العربية غير موجود

# ChapterForEnglishLanguageNotExist
source: Chapter for English language does not exist
ar: الفصل باللغة الإنجليزية غير موجود

# ThisLanguageNotExist
source: This language does not exist
ar: هذه اللغة غير موجودة

source: Views increased by 1
ar: تم زيادة عدد المشاهدات بمقدار 1

# AnErrorOccurredWhileIncreasingTheViewByOne
source: An error occurred while increasing the view count by one
ar: حدث خطأ أثناء زيادة عدد المشاهدات بمقدار واحد

source: An error occurred while adding the category
ar: حدث خطأ أثناء إضافة التصنيف

# CategoryAddedSuccessfully
source: The category has been added successfully
ar: تمت إضافة التصنيف بنجاح

# CategoryNameEnIsRequired
source: The English category name is required
ar: اسم التصنيف باللغة الإنجليزية مطلوب

# CategoryNameEnNotNull
source: The English category name cannot be null
ar: اسم التصنيف باللغة الإنجليزية لا يمكن أن يكون فارغًا

# CategoryNameEnMaxLengthIs100
source: The English category name must not exceed 100 characters
ar: يجب ألا يتجاوز اسم التصنيف باللغة الإنجليزية 100 حرف

# CategoryNameArIsRequired
source: The Arabic category name is required
ar: اسم التصنيف باللغة العربية مطلوب

# CategoryNameArNotNull
source: The Arabic category name cannot be null
ar: اسم التصنيف باللغة العربية لا يمكن أن يكون فارغاً

# CategoryNameArMaxLengthIs100
source: The Arabic category name must not exceed 100 characters
ar: يجب ألا يتجاوز اسم التصنيف باللغة العربية 100 حرف

# IsActiveIsRequired
source: The “IsActive” field is required
ar: حقل "IsActive" مطلوب

source: Category not found
ar: لم يتم العثور على التصنيف

source: An error occurred while deleting the category
ar: حدث خطأ أثناء حذف التصنيف

# CategoryDeletedSuccessfully
source: The category has been deleted successfully
ar: تم حذف التصنيف بنجاح

# CategoryAlreadyActive
source: The category is already active
ar: التصنيف مفعل بالفعل

# AnErrorOccurredWhileActivateTheCategory
source: An error occurred while activating the category
ar: حدث خطأ أثناء تفعيل التصنيف

# CategoryActivateSuccessfully
source: The category has been activated successfully
ar: تم تفعيل التصنيف بنجاح

# CategoryAlreadDeActive
source: The category is already deactivated
ar: التصنيف معطل بالفعل

# AnErrorOccurredWhileDeActivateTheCategory
source: An error occurred while deactivating the category
ar: حدث خطأ أثناء تعطيل التصنيف

# CategoryDeActivateSuccessfully
source: The category has been deactivated successfully
ar: تم تعطيل التصنيف بنجاح

# CategoryIdIsRequired
source: The category ID is required
ar: معرف التصنيف مطلوب

# CategoryIdNotNull
source: The category ID cannot be null
ar: معرف التصنيف لا يمكن أن يكون فارغًا

source: An error occurred while updating the category
ar: حدث خطأ أثناء تحديث التصنيف

# CategoryUpdatedSuccessfully
source: The category has been updated successfully
ar: تم تحديث التصنيف بنجاح

source: Category found
ar: تم العثور على التصنيف

# MangaNameEnIsRequired
source: Manga name in English is required
ar: اسم المانجا بالإنجليزية مطلوب

# MangaNameEnNotNull
source: Manga name in English cannot be null
ar: لا يمكن أن يكون اسم المانجا بالإنجليزية فارغًا

# MangaNameEnMustNotExceed100Characters
source: Manga name in English must not exceed 100 characters
ar: يجب ألا يتجاوز اسم المانجا بالإنجليزية 100 حرف

# MangaNameArIsRequired
source: Manga name in Arabic is required
ar: اسم المانجا بالعربية مطلوب

# MangaNameArNotNull
source: Manga name in Arabic cannot be null
ar: لا يمكن أن يكون اسم المانجا بالعربية فارغًا

# MangaNameArMustNotExceed100Characters
source: Manga name in Arabic must not exceed 100 characters
ar: يجب ألا يتجاوز اسم المانجا بالعربية 100 حرف

# StatusEnIsRequired
source: Status in English is required
ar: الحالة بالإنجليزية مطلوبة

# StatusEnNotNull
source: Status in English cannot be null
ar: لا يمكن أن تكون الحالة بالإنجليزية فارغة

# StatusEnMustNotExceed50Characters
source: Status in English must not exceed 50 characters
ar: يجب ألا تتجاوز الحالة بالإنجليزية 50 حرفًا

# StatusArIsRequired
source: Status in Arabic is required
ar: الحالة بالعربية مطلوبة

# StatusArNotNull
source: Status in Arabic cannot be null
ar: لا يمكن أن تكون الحالة بالعربية فارغة

# StatusArMustNotExceed50Characters
source: Status in Arabic must not exceed 50 characters
ar: يجب ألا تتجاوز الحالة بالعربية 50 حرفًا

# TypeEnIsRequired
source: Type in English is required
ar: النوع بالإنجليزية مطلوب

# TypeEnNotNull
source: Type in English cannot be null
ar: لا يمكن أن يكون النوع بالإنجليزية فارغًا

# TypeEnMustNotExceed50Characters
source: Type in English must not exceed 50 characters
ar: يجب ألا يتجاوز النوع بالإنجليزية 50 حرفًا

# TypeArIsRequired
source: Type in Arabic is required
ar: النوع بالعربية مطلوب

# TypeArNotNull
source: Type in Arabic cannot be null
ar: لا يمكن أن يكون النوع بالعربية فارغًا

# TypeArMustNotExceed50Characters
source: Type in Arabic must not exceed 50 characters
ar: يجب ألا يتجاوز النوع بالعربية 50 حرفًا

# AuthorEnMustNotExceed100Characters
source: Author in English must not exceed 100 characters
ar: يجب ألا يتجاوز اسم المؤلف بالإنجليزية 100 حرف

# AuthorArMustNotExceed100Characters
source: Author in Arabic must not exceed 100 characters
ar: يجب ألا يتجاوز اسم المؤلف بالعربية 100 حرف

# DescriptionEnMustNotExceed1000Characters
source: Description in English must not exceed 1000 characters
ar: يجب ألا تتجاوز الوصف بالإنجليزية 1000 حرف

# DescriptionArMustNotExceed1000Characters
source: Description in Arabic must not exceed 1000 characters
ar: يجب ألا يتجاوز الوصف بالعربية 1000 حرف

source: There was a problem adding the manga
ar: حدثت مشكلة أثناء إضافة المانجا

# AnErrorOccurredWhileAddingTheImageForManga
source: An error occurred while adding the image for the manga
ar: حدث خطأ أثناء إضافة الصورة الخاصة بالمانجا

source: Manga added successfully
ar: تم إضافة المانجا بنجاح

source: An error occurred while adding the manga
ar: حدث خطأ أثناء إضافة المانجا

source: An error occurred while deleting the manga
ar: حدث خطأ أثناء حذف المانجا

source: Manga deleted successfully.
ar: تم حذف المانجا بنجاح

# AnErrorOccurredWhileProcessingImageModificationRequest
source: An error occurred while processing the image modification request
ar: حدث خطأ أثناء معالجة طلب تعديل الصورة

# ArabicAvailableForThisMangaAlready
source: Arabic is already available for this manga
ar: اللغة العربية متوفرة بالفعل لهذه المانجا

# MakeArabicAvilableForThisMangaSuccessfully
source: Arabic made available for this manga successfully
ar: تم تفعيل اللغة العربية لهذه المانجا بنجاح

# AnErrorOccurredWhileMakingArabicAvilableForThisManga
source: An error occurred while making Arabic available for this manga
ar: حدث خطأ أثناء تفعيل اللغة العربية لهذه المانجا

# ArabicNotAvailableForThisMangaAlready
source: Arabic is not available for this manga already
ar: اللغة العربية غير متوفرة بالفعل لهذه المانجا

# MakeArabicNotAvilableForThisMangaSuccessfully
source: Arabic made unavailable for this manga successfully
ar: تم إلغاء تفعيل اللغة العربية لهذه المانجا بنجاح

# AnErrorOccurredWhileMakingArabicNotAvilableForThisManga
source: An error occurred while making Arabic unavailable for this manga
ar: حدث خطأ أثناء إلغاء تفعيل اللغة العربية لهذه المانجا

# EnglishAvailableForThisMangaAlready
source: English is already available for this manga
ar: اللغة الإنجليزية متوفرة بالفعل لهذه المانجا

# MakeEnglishAvilableForThisMangaSuccessfully
source: English made available for this manga successfully
ar: تم تفعيل اللغة الإنجليزية لهذه المانجا بنجاح

# AnErrorOccurredWhileMakingEnglishAvilableForThisManga
source: An error occurred while making English available for this manga
ar: حدث خطأ أثناء تفعيل اللغة الإنجليزية لهذه المانجا

# EnglishNotAvailableForThisMangaAlready
source: English is not available for this manga already
ar: اللغة الإنجليزية غير متوفرة بالفعل لهذه المانجا

# MakeEnglishNotAvilableForThisMangaSuccessfully
source: English made unavailable for this manga successfully
ar: تم إلغاء تفعيل اللغة الإنجليزية لهذه المانجا بنجاح

# AnErrorOccurredWhileMakingEnglishNotAvilableForThisManga
source: An error occurred while making English unavailable for this manga
ar: حدث خطأ أثناء إلغاء تفعيل اللغة الإنجليزية لهذه المانجا

# MangaAlreadyActive
source: Manga is already active
ar: المانجا مفعلة بالفعل

# ActivateMangaSuccessfully
source: Manga activated successfully
ar: تم تفعيل المانجا بنجاح

# AnErrorOccurredWhileActivateThisManga
source: An error occurred while activating this manga
ar: حدث خطأ أثناء تفعيل هذه المانجا

# MangaAlreadyDeActive
source: Manga is already deactivated
ar: المانجا معطلة بالفعل

# DeActivateMangaSuccessfully
source: Manga deactivated successfully
ar: تم تعطيل المانجا بنجاح

# AnErrorOccurredWhileDeActivateThisManga
source: An error occurred while deactivating this manga
ar: حدث خطأ أثناء تعطيل هذه المانجا

source: Manga ID is required
ar: رقم تعريف المانجا مطلوب

# MangaIdNotNull
source: Manga ID cannot be null
ar: لا يمكن أن يكون رقم تعريف المانجا فارغًا

# MangaUpdatingSuccessfully
source: Manga updated successfully
ar: تم تحديث المانجا بنجاح

source: An error occurred while updating the manga
ar: حدث خطأ أثناء تحديث المانجا

# CategoryNameEnAlreadyExist
source: Category name in English already exists
ar: اسم التصنيف بالإنجليزية موجود بالفعل

# CategoryNameArAlreadyExist
source: Category name in Arabic already exists
ar: اسم التصنيف بالعربية موجود بالفعل

# MangaNameEnAlreadyExist
source: Manga name in English already exists
ar: اسم المانجا بالإنجليزية موجود بالفعل

# MangaNameArAlreadyExist
source: Manga name in Arabic already exists
ar: اسم المانجا بالعربية موجود بالفعل

# AnErrorOccurredWhileActivatingOrDeActivatingProcess
source: An error occurred during the activation or deactivation process
ar: حدث خطأ أثناء عملية التفعيل أو التعطيل

# AnErrorOccurredWhileMakingEnglishAvilableOrNotAvilableProcess
source: An error occurred during the process of making English available or unavailable
ar: حدث خطأ أثناء عملية تفعيل أو إلغاء تفعيل اللغة الإنجليزية

# AnErrorOccurredWhileMakingArabicAvilableOrNotAvilableProcess
source: An error occurred during the process of making Arabic available or unavailable
ar: حدث خطأ أثناء عملية تفعيل أو إلغاء تفعيل اللغة العربية

# StatusInEnglishMustBeEitherOngoingOrCompletedOrOneShot
source: Status in English must be either “Ongoing”, “Completed”, or “One shot”
ar: يجب أن تكون الحالة بالإنجليزية إما "Ongoing" أو "Completed" أو "One shot"

# StatusInArabicMustBeEitherOngoingOrCompletedOrOneShot
source: Status in Arabic must be either “مستمر”, “مكتمل”, or “ون شوت”
ar: يجب أن تكون الحالة بالعربية إما "مستمر" أو "مكتمل" أو "ون شوت"

# TypeInEnglishMustBeEitherMangaOrManhwaOrManhua
source: Type in English must be either “Manga”, “Manhwa”, or “Manhua”
ar: يجب أن يكون النوع بالإنجليزية إما "Manga" أو "Manhwa" أو "Manhua"

# TypeInArabicMustBeEitherMangaOrManhwaOrManhua
source: Type in Arabic must be either “مانجا”, “مانهوا”, or “مانهوا صينية”
ar: يجب أن يكون النوع بالعربية إما "مانجا" أو "مانهوا" أو "مانهوا صينية"

# MangaIdGreaterThanZero
source: Manga ID must be greater than zero
ar: يجب أن يكون رقم تعريف المانجا أكبر من صفر

# ChapterNoIsRequired
source: Chapter number is required
ar: رقم الفصل مطلوب

# ChapterNoNotNull
source: Chapter number cannot be null
ar: لا يمكن أن يكون رقم الفصل فارغًا

# ChapterNoGreaterThanZero
source: Chapter number must be greater than zero
ar: يجب أن يكون رقم الفصل أكبر من صفر

source: Language is required
ar: اللغة مطلوبة

# LanguageNotNull
source: Language cannot be null
ar: لا يمكن أن تكون اللغة فارغة

source: Language must not exceed 50 characters
ar: يجب ألا تتجاوز اللغة 50 حرفًا

source: Language must be either “Arabic” or “English”
ar: يجب أن تكون اللغة إما "العربية" أو "الإنجليزية

# EnglishChapterTitleMustNotExceed100Characters
source: Chapter title in English must not exceed 100 characters
ar: يجب ألا يتجاوز عنوان الفصل بالإنجليزية 100 حرف

# ArabicChapterTitleMustNotExceed100Characters
source: Chapter title in Arabic must not exceed 100 characters
ar: يجب ألا يتجاوز عنوان الفصل بالعربية 100 حرف

source: Chapter images are required
ar: صور الفصل مطلوبة

source: Chapter image size must not exceed 5 MB
ar: يجب ألا يتجاوز حجم صورة الفصل 15 ميغابايت

# ChapterNoForThisLanguageAlreadyExist
source: Chapter number for this language already exists
ar: رقم الفصل لهذه اللغة موجود بالفعل

# AnErrorOccurredWhileAddingTheImageForChapter
source: An error occurred while adding the image for the chapter
ar: حدث خطأ أثناء إضافة الصورة الخاصة بالفصل

source: An error occurred while adding the chapter
ar: حدث خطأ أثناء إضافة الفصل

source: Chapter added successfully
ar: تم إضافة الفصل بنجاح

# ChapterAddedSuccessfullyAndArabicBecameInactiveDueToIncompleteChapters
source: Chapter added successfully, but Arabic became inactive due to incomplete chapters
ar: تم إضافة الفصل بنجاح، ولكن اللغة العربية أصبحت غير مفعلة بسبب فصول غير مكتملة

# ChapterAddedSuccessfullyAndEnglishBecameInactiveDueToIncompleteChapters
source: Chapter added successfully, but English became inactive due to incomplete chapters
ar: تم إضافة الفصل بنجاح، ولكن اللغة الإنجليزية أصبحت غير مفعلة بسبب فصول غير مكتملة

source: Chapter deleted successfully
ar: تم حذف الفصل بنجاح

source: Chapter deleted successfully, and Arabic became inactive due to incomplete chapters
ar: تم حذف الفصل بنجاح، وأصبحت اللغة العربية غير مفعلة بسبب فصول غير مكتملة

source: Chapter deleted successfully, and English became inactive due to incomplete chapters
ar: تم حذف الفصل بنجاح، وأصبحت اللغة الإنجليزية غير مفعلة بسبب فصول غير مكتملة

source: An error occurred while deleting the chapter
ar: حدث خطأ أثناء حذف الفصل

# CanNotMakeArabicAvialableDueToIncompleteChapters
source: Cannot make Arabic available due to incomplete chapters
ar: لا يمكن تفعيل اللغة العربية بسبب فصول غير مكتملة

# CanNotMakeEnglishAvialableDueToIncompleteChapters
source: Cannot make English available due to incomplete chapters
ar: لا يمكن تفعيل اللغة الإنجليزية بسبب فصول غير مكتملة

source: Chapter ID is required
ar: رقم تعريف الفصل مطلوب

# ChapterIdGreaterThanZero
source: Chapter ID must be greater than zero
ar: يجب أن يكون رقم تعريف الفصل أكبر من صفر

source: An error occurred while updating the chapter
ar: حدث خطأ أثناء تحديث الفصل

source: Chapter updated successfully
ar: تم تحديث الفصل بنجاح

# AnErrorOccurredWhileProcessingTheImagesIploadRequest
source: An error occurred while processing the images upload request
ar: حدث خطأ أثناء معالجة طلب رفع الصور

source: Images are being uploaded to cloud storage, please wait a little while
ar: يتم رفع الصور إلى التخزين السحابي، يرجى الانتظار قليلاً

# Accepted
source: The request has been accepted for processing
ar: تم قبول الطلب للمعالجة

source: An error occurred while saving the last login
ar: حدث خطأ أثناء حفظ آخر تسجيل دخول

source: Users not found
ar: لم يتم العثور على المستخدمين

source: Users found
ar: تم العثور على المستخدمين

# UserToActivateToggleNotFound
source: User to activate/deactivate not found
ar: المستخدم المطلوب تفعيله/تعطيله غير موجود

# ActivateUserSuccessfully
source: User activated successfully
ar: تم تفعيل المستخدم بنجاح

# DeActivateUserSuccessfully
source: User deactivated successfully
ar: تم تعطيل المستخدم بنجاح

# YouCanNotDoThisProcessToYourself
source: You cannot perform this action on yourself
ar: لا يمكنك تنفيذ هذه العملية على نفسك

# UserToChangeRoleToggleNotFound
source: User to change role not found
ar: المستخدم المطلوب تغيير دوره غير موجود

# AnErrorOccurredWhileDeletingOldRole
source: An error occurred while deleting the old role
ar: حدث خطأ أثناء حذف الدور القديم

# AnErrorOccurredWhileAddingTheUserToRole
source: An error occurred while adding the user to the role
ar: حدث خطأ أثناء إضافة المستخدم إلى الدور

# TheUserRoleHasBeenModifiedToBecomeAAdmin
source: The user role has been modified to become an Admin
ar: تم تعديل دور المستخدم ليصبح مسؤولًا

source: The user role has been modified to become a User
ar: تم تعديل دور المستخدم ليصبح مستخدمًا

source: Failed to add user role
ar: فشل في إضافة دور المستخدم

source: You have exceeded the limit for sending password reset emails. Please try again later
ar: لقد تجاوزت الحد المسموح لإرسال رسائل إعادة تعيين كلمة المرور. يرجى المحاولة لاحقًا

source: You have exceeded the limit for sending confirmation emails. Please try again later
ar: لقد تجاوزت الحد المسموح لإرسال رسائل التأكيد. يرجى المحاولة لاحقًا

# YouHaveExceededTheLimitForSendingLoginRequestPleaseTryAgainLater
source: You have exceeded the limit for sending login requests. Please try again later
ar: لقد تجاوزت الحد المسموح لإرسال طلبات تسجيل الدخول. يرجى المحاولة لاحقًا.
