Repository: darxx03eh/ARABOON-Backend
Catalog: Araboon.Core/Translations/SharedTranslation.*.resx
Languages: ar

source: An error occurred during the registration process
ar: حدث خطأ أثناء عملية التسجيل

source: An error occurred while adding the image
ar: حدث خطأ أثناء إضافة الصورة

source: An error occurred while sending the confirmation email. Please try again
ar: حدث خطأ أثناء إرسال بريد التأكيد. يرجى المحاولة مرة أخرى

# BadRequest
source: Something went wrong with the request
ar: حدث خطأ في الطلب

# Created
source: Created successfully
ar: تم الإنشاء بنجاح

# Deleted
source: The delete operation was completed successfully
ar: تم تنفيذ عملية الحذف بنجاح

source: Email confirmed successfully
ar: تم تأكيد البريد الإلكتروني بنجاح

# EmailNotEmpty
source: Email must not be empty
ar: البريد الإلكتروني لا يمكن أن يكون فارغًا

# EmailNotNull
source: Email is required
ar: البريد الإلكتروني مطلوب

# ErrorDuringAccountCreationProcess
source: An error occurred during the account creation process. Please try again later
ar: حدث خطأ أثناء إنشاء الحساب. يرجى المحاولة مرة أخرى لاحقًا

# ErrorWhileAddingRole
source: An error occurred while adding the role
ar: حدث خطأ أثناء إضافة الصلاحية

# FirstNameNotEmpty
source: First name must not be empty
ar: لاسم الأول لا يمكن أن يكون فارغًا

# FirstNameNotNull
source: First name is required
ar: الاسم الأول مطلوب

# Forbidden
source: Sorry, you do not have the necessary permission to access this resource
ar: عذرًا، لا تملك الصلاحية اللازمة للوصول إلى هذا المورد

source: Internal server error
ar: خطأ في الخادم الداخلي

source: Invalid or expired token
ar: رمز التحقق غير صالح أو منتهي الصلاحية

# KeyNotFoundException
source: Key not found
ar: المفتاح غير موجود

# LastNameNotEmpty
source: Last name must not be empty
ar: اسم العائلة لا يمكن أن يكون فارغًا

# LastNameNotNull
source: Last name is required
ar: اسم العائلة مطلوب

# NotFound
source: The requested item was not found
ar: العنصر المطلوب غير موجود

# RoleNotExist
source: The specified role does not exist
ar: الصلاحية المطلوبة غير موجودة

# Success
source: Operation completed successfully
ar: تم تنفيذ العملية بنجاح

# TheAccountHasBeenCreated
source: Registration successful. A confirmation email has been sent to your inbox
ar: تم التسجيل بنجاح. لقد أرسلنا إليك بريدًا إلكترونيًا لتأكيد الحساب.

# Unauthorized
source: You cannot perform this action – Please log in first
ar: لا يمكنك تنفيذ هذه العملية – الرجاء تسجيل الدخول أولًا

# UnauthorizedAccessException
source: Unauthorized access
ar: وصول غير مصرح به

# UnprocessableEntity
source: The submitted data is unprocessable
ar: البيانات المُرسلة غير صالحة للمعالجة

source: User not found
ar: المستخدم غير موجود

source: Validation failed
ar: فشل التحقق من صحة البيانات

# NotValidEmail
source: Invalid email address
ar: البريد الإلكتروني غير صالح

# UserNameNotEmpty
source: Username must not be empty
ar: سم المستخدم لا يمكن أن يكون فارغًا

# UserNameNotNull
source: Username is required
ar: اسم المستخدم مطلوب

# PasswordNotEmpty
source: Password must not be empty
ar: كلمة المرور لا يمكن أن تكون فارغة

# PasswordNotNull
source: Password is required
ar: كلمة المرور مطلوبة

# PasswordMinimumLength
source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

# ConfirmPasswordNotEmpty
source: Confirm password must not be empty.
ar: تأكيد كلمة المرور لا يمكن أن يكون فارغًا

# ConfirmPasswordNotNull
source: Confirm password is required
ar: تأكيد كلمة المرور مطلوب

# ConfirmPasswordMinimumLength
source: Confirm password must be at least 8 characters long
ar: يجب أن يكون تأكيد كلمة المرور 8 أحرف على الأقل

# ConfirmPasswordMustEqualToPassword
source: Confirm password must match the password
ar: تأكيد كلمة المرور يجب أن يطابق كلمة المرور

# UserNameAlreadyExist
source: Username is already taken. Please choose another one
ar: اسم المستخدم مستخدم مسبقًا. يرجى اختيار اسم آخر

# EmailAlreadyExist
source: Email is already in use. Please use a different email address
ar: البريد الإلكتروني مستخدم مسبقًا. يرجى استخدام بريد إلكتروني آخر

source: Email not confirmed
ar: البريد الإلكتروني غير مُؤكد

# PasswordOrUserNameWrnog
source: Incorrect username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة

source: An error occurred while generating the token
ar: دث خطأ أثناء توليد رمز الدخول

source: An error occurred during the login process
ar: حدث خطأ أثناء عملية تسجيل الدخول

# DataVerifiedAndLogin
source: Data verified and login successful
ar: تم التحقق من البيانات وتسجيل الدخول بنجاح

# UserNameNotExist
source: Username does not exist
ar: اسم المستخدم غير موجود

# YourAccountIsInactivePleaseCheckWithTechnicalSupport
source: Your account is inactive. Please contact technical support
ar: حسابك غير مفعل، يرجى التواصل مع الدعم الفني

# EmailConfirmationEmailHasBeenSent
source: The email confirmation message has been sent
ar: تم إرسال رسالة تأكيد البريد الإلكتروني

source: Your account has already been confirmed
ar: تم تأكيد حسابك مسبقًا

source: Invalid token format
ar: تنسيق الرمز غير صالح

# TokenExpired
source: The token has expired
ar: انتهت صلاحية الرمز

source: An error occurred while verifying the token
ar: حدث خطأ أثناء التحقق من الرمز

# ValidToken
source: The token is valid
ar: الرمز صالح

# ErrorInTheEncryptionAlgorithmUsed
source: An error occurred in the encryption algorithm used
ar: حدث خطأ في خوارزمية التشفير المستخدمة

# TokenIsStillValidCannotRefreshYet
source: The token is still valid and cannot be refreshed yet
ar: الرمز لا يزال صالحًا، لا يمكن تحديثه حاليًا

# RefreshTokenIsNotFound
source: Refresh token not found
ar: لم يتم العثور على رمز التحديث

# RefreshTokenHasExpire
source: The refresh token has expired
ar: رمز التحديث منتهي الصلاحية

source: An error occurred during the token generation process
ar: حدث خطأ أثناء عملية إنشاء الرمز

# AccessTokenRegenerated
source: Access token has been regenerated successfully
ar: تم إعادة إنشاء رمز الدخول بنجاح

# InvalidRefreshToken
source: Cannot revoke the token because it is invalid
ar: لا يمكن إلغاء صلاحية الرمز لأنه غير صالح

# AnErrorOccurredDuringTheRefreshTokenCancellationProcess
source: An error occurred while revoking the refresh token
ar: حدث خطأ أثناء إلغاء صلاحية رمز التحديث

source: Token revoked successfully
ar: تم إلغاء صلاحية الرمز بنجاح

source: An error occurred while saving the code
ar: حدث خطأ أثناء حفظ الكود

source: An error occurred while sending the forget password email. Please try again
ar: حدث خطأ أثناء إرسال رسالة استعادة كلمة المرور، يرجى المحاولة مرة أخرى

# ForgetPasswordEmailHasBeenSent
source: The forget password email has been sent to your email address
ar: تم إرسال رسالة استعادة كلمة المرور إلى بريدك الإلكتروني

source: The code has expired
ar: انتهت صلاحية الكود

source: The code entered is incorrect
ar: الكود المُدخل غير صحيح

source: An error occurred while deleting the code
ar: حدث خطأ أثناء حذف الكود

# TheCodeHasbeenVerified
source: The code has been verified successfully
ar: تم التحقق من الكود بنجاح

source: An error occurred while deleting the old password
ar: حدث خطأ أثناء حذف كلمة المرور القديمة

source: An error occurred while adding the new password
ar: حدث خطأ أثناء إضافة كلمة المرور الجديدة

source: An error occurred while changing the password
ar: حدث خطأ أثناء تغيير كلمة المرور

source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: An error occurred while saving the password reset token
ar: حدث خطأ أثناء حفظ رمز إعادة تعيين كلمة المرور

# InvalidPasswordResetToken
source: The password reset token is invalid
ar: رمز إعادة تعيين كلمة المرور غير صالح

source: There was a problem deleting the password reset token
ar: حدثت مشكلة أثناء حذف رمز إعادة تعيين كلمة المرور

# PasswordResetTokenNotEmpty
source: Password reset token must not be empty
ar: رمز إعادة تعيين كلمة المرور لا يمكن أن يكون فارغًا

# PasswordResetTokenNotNull
source: Password reset token is required
ar: رمز إعادة تعيين كلمة المرور مطلوب

source: Your account was locked due to suspicious activity. Please try again later or contact support
ar: تم قفل حسابك بسبب نشاط مريب. يرجى المحاولة لاحقًا أو التواصل مع الدعم الفني

source: The resource that is being accessed is locked
ar: المورد الذي تحاول الوصول إليه مقفل

source: An error occurred during the email confirmation process
ar: حدث خطأ أثناء عملية تأكيد البريد الإلكتروني

source: Manga not found
ar: المانجا غير موجودة

source: Manga found
ar: تم العثور على المانجا

# StatusNotEmpty
source: Status must not be empty
ar: الحالة لا يمكن أن تكون فارغة

# StatusNotNull
source: Status field is required and must not be empty or null
ar: حقل الحالة مطلوب ولا يجوز أن يكون فارغًا أو null

# ValidationError
source: Please check the entered data and fix the errors before proceeding
ar: رجاءً، تحقق من صحة البيانات المدخلة وأصلح الأخطاء قبل المتابعة

# FavoritesServiceforRegisteredUsersOnly
source: Favorites service is available for registered users only
ar: خدمة المفضلة متاحة فقط للمستخدمين المسجلين

# AddedToFavorites
source: Successfully added to favorites
ar: تمّت الإضافة إلى المفضلة بنجاح

# ThereWasAProblemAddingTofavorites
source: There was a problem adding to favorites. Please try again later
ar: حدثت مشكلة أثناء الإضافة إلى المفضلة. يرجى المحاولة لاحقًا

# ThereWasAProblemDeletingFromFavorites
source: There was a problem deleting from favorites. Please try again later
ar: حدثت مشكلة أثناء الحذف من المفضلة. يرجى المحاولة لاحقًا

# RemovedFromFavorites
source: Removed from favorites successfully
ar: تم الحذف من المفضلة بنجاح

source: This manga is already in your favorites list
ar: هذا المانجا موجود بالفعل في قائمة المفضلة الخاصة بك

# Conflict
source: The request could not be completed due to a conflict with the current state of the resource
ar: تعذر إكمال الطلب بسبب تعارض مع الحالة الحالية للموارد

source: This manga is not in your favorites list
ar: هذه المانجا غير موجودة في قائمة المفضلة الخاصة بك

source: There are no manga in your favorites list
ar: لا توجد أي مانجا في قائمة المفضلة الخاصة بك

source: The manga was found in your favorites list
ar: المانجا موجودة بالفعل في قائمة المفضلة الخاصة بك

# NoContent
source: No data available at the moment
ar: لا توجد بيانات متاحة حاليًا

# CompletedReadsServiceforRegisteredUsersOnly
source: CompletedReadsService is available for registered users only
ar: خدمة المانجا المكتملة متاحة فقط للمستخدمين المسجّلين

source: This manga is already in your completed reads list
ar: هذه المانجا موجودة بالفعل في قائمة المانجا المكتملة الخاصة بك

source: Added to completed reads
ar: تمت الإضافة إلى قائمة المانجا المكتملة

source: There was a problem adding to completed reads
ar: حدثت مشكلة أثناء الإضافة إلى قائمة المانجا المكتملة

source: This manga is not in your completed reads list
ar: هذه المانجا غير موجودة في قائمة قراءاتك المكتملة

source: Removed from completed reads
ar: تمت الإزالة من قائمة القراءات المكتملة

source: There was a problem deleting from completed reads
ar: حدثت مشكلة أثناء الحذف من قائمة القراءات المكتملة

source: There are no manga in your completed reads list
ar: لا توجد مانجا في قائمة قراءاتك المكتملة

source: The manga was found in your completed reads list
ar: تم العثور على المانجا في قائمة قراءاتك المكتملة

# CurrentlyReadingServiceforRegisteredUsersOnly
source: The Currently Reading service is available for registered users only
ar: خدمة القراءة حالياً متاحة للمستخدمين المسجلين فقط

source: This manga is already in your Currently Reading list
ar: هذه المانجا موجودة بالفعل في قائمة القراءة حالياً الخاصة بك

# AddedToCurrentlyReading
source: The manga has been added to your Currently Reading list
ar: تمت إضافة المانجا إلى قائمة القراءة حالياً الخاصة بك

# ThereWasAProblemAddingToCurrentlyReading
source: There was a problem adding the manga to your Currently Reading list
ar: حدثت مشكلة أثناء إضافة المانجا إلى قائمة القراءة حالياً الخاصة بك

source: This manga is not in your Currently Reading list
ar: هذه المانجا غير موجودة في قائمة القراءة حالياً الخاصة بك

# RemovedFromCurrentlyReading
source: Manga removed from your Currently Reading list
ar: تمت إزالة المانجا من قائمة القراءة حالياً الخاصة بك

# ThereWasAProblemDeletingFromCurrentlyReading
source: There was a problem deleting the manga from your Currently Reading list
ar: حدثت مشكلة أثناء حذف المانجا من قائمة القراءة حالياً الخاصة بك

source: There are no manga in your Currently Reading list
ar: لا توجد أي مانجا في قائمة القراءة حالياً الخاصة بك

source: The manga was found in your Currently Reading list
ar: تم العثور على المانجا في قائمة القراءة حالياً الخاصة بك

# ReadingLaterServiceforRegisteredUsersOnly
source: Read Later service is available for registered users only
ar: خدمة القراءة لاحقاً متاحة للمستخدمين المسجلين فقط

# ThisMangaIsAlreadyInYourReadingLaterList
source: This manga is already in your Read Later list
ar: هذه المانجا موجودة بالفعل في قائمة القراءة لاحقاً

# AddedToReadingLater
source: Manga has been added to your Read Later list
ar: تمت إضافة المانجا إلى قائمة القراءة لاحقاً

# ThereWasAProblemAddingToReadingLater
source: There was a problem adding the manga to your Read Later list
ar: حدثت مشكلة أثناء إضافة المانجا إلى قائمة القراءة لاحقاً

# ThisMangaIsNotInYourReadingLaterList
source: This manga is not in your Read Later list
ar: هذه المانجا غير موجودة في قائمة القراءة لاحقاً

# RemovedFromReadingLater
source: Removed from Read Later list
ar: تمت الإزالة من قائمة القراءة لاحقاً

# ThereWasAProblemDeletingFromReadingLater
source: There was a problem deleting from the Read Later list
ar: حدثت مشكلة أثناء الحذف من قائمة القراءة لاحقاً

# ThereAreNoMangaInYourReadingLaterList
source: There are no manga in your Read Later list
ar: لا توجد مانجا في قائمة القراءة لاحقاً

# TheMangaWasFoundInYourReadingLaterList
source: The manga was found in your Read Later list
ar: تم العثور على المانجا في قائمة القراءة لاحقًا

# NotificationsServiceforRegisteredUsersOnly
source: Notifications service is available for registered users only
ar: خدمة الإشعارات متاحة للمستخدمين المسجلين فقط

source: This manga is already in your notifications list
ar: هذه المانجا موجودة بالفعل في قائمة الإشعارات الخاصة بك

source: Added to notifications
ar: تمت الإضافة إلى الإشعارات

source: There was a problem adding to notifications
ar: حدثت مشكلة أثناء الإضافة إلى الإشعارات

source: This manga is not in your notifications list
ar: هذه المانجا غير موجودة في قائمة الإشعارات الخاصة بك

source: Removed from notifications
ar: تمت الإزالة من الإشعارات

source: There was a problem deleting from notifications
ar: حدثت مشكلة أثناء الحذف من الإشعارات

source: There are no manga in your notifications list
ar: ا توجد مانجا في قائمة الإشعارات الخاصة بك

source: The manga was found in your notifications list
ar: تم العثور على المانجا في قائمة الإشعارات الخاصة بك

# MarkAsReadForChaptersServiceforRegisteredUsersOnly
source: Mark as read for chapters service is available for registered users only
ar: خدمة تعليم الفصول كمقروءة متاحة للمستخدمين المسجلين فقط

# ThisMangaAndChapterIsAlreadyMarkedAsRead
source: This manga and chapter are already marked as read
ar: تم تعليم هذا المانجا والفصل كمقروءين بالفعل

source: Marked as read
ar: تم التعليم كمقروء

# ThereWasAProblemMarkedAsRead
source: There was a problem marking as read
ar: حدثت مشكلة أثناء تعليم كمقروء

# MarkAsUnReadForChaptersServiceforRegisteredUsersOnly
source: Mark as unread for chapters service is available for registered users only
ar: خدمة تعليم الفصول كغير مقروءة متاحة للمستخدمين المسجلين فقط

source: Marked as unread
ar: تم التعليم كغير مقروء

# ThereWasAProblemMarkedAsUnRead
source: There was a problem marking as unread
ar: حدثت مشكلة أثناء التعليم كغير مقروء

# ThisChapterIsNotInThisManga
source: This chapter is not part of this manga
ar: هذا الفصل لا ينتمي إلى هذه المانجا

# ThisChapterForThisMangaIsNotExistInMarkedAsRead
source: This chapter for this manga does not exist in the marked as read list
ar: هذا الفصل لهذه المانجا غير موجود في قائمة المقروءة

source: This chapter in this manga is already marked as read
ar: هذا الفصل في هذه المانجا تم تحديده كمقروء مسبقًا

source: The language you requested is not available for this manga
ar: اللغة التي طلبتها غير متوفرة لهذه المانجا

source: There are no chapters yet
ar: لا توجد فصول بعد

source: The chapters were found
ar: تم العثور على الفصول

source: Categories not found
ar: الفئات غير موجودة

source: Categories found
ar: تم العثور على الفئات

source: Invalid token
ar: الرمز غير صالح

source: There was a problem validating the code
ar: حدثت مشكلة أثناء التحقق من الرمز

source: There was a problem loading the profile
ar: حدثت مشكلة أثناء تحميل الملف الشخصي

source: User found
ar: تم العثور على المستخدم

source: The current password is wrong
ar: كلمة المرور الحالية غير صحيحة

source: The new password must be different from the current one
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن الحالية

# CurrentPasswordNotEmpty
source: Current password must not be empty
ar: يجب ألا تكون كلمة المرور الحالية فارغة

# CurrentPasswordNotNull
source: Current password is required
ar: كلمة المرور الحالية مطلوبة

source: Username changed successfully
ar: تم تغيير اسم المستخدم بنجاح

source: An error occurred while changing the username
ar: حدث خطأ أثناء تغيير اسم المستخدم

source: Image is required
ar: الصورة مطلوبة

source: Image size must not exceed 2MB
ar: يجب ألا يتجاوز حجم الصورة 2 ميغابايت

source: Only JPEG, PNG, and WebP formats are allowed
ar: يُسمح فقط بصيغ JPEG و PNG و WebP

# AnErrorOccurredWhileEditingImageData
source: An error occurred while editing the image data
ar: حدث خطأ أثناء تعديل بيانات الصورة

source: The image has been changed successfully
ar: تم تغيير الصورة بنجاح

source: An error occurred while processing your profile image modification request
ar: حدث خطأ أثناء معالجة طلب تعديل صورة الملف الشخصي الخاص بك

source: Image size must not exceed 5MB
ar: يجب ألا يتجاوز حجم الصورة 5 ميغابايت

# CroppedImageIsRequired
source: Cropped image size must not exceed 5MB
ar: يجب ألا يتجاوز حجم الصورة المقصوصة 5 ميغابايت

# CroppedImageImageIsRequired
source: Cropped image is required
ar: الصورة المقصوصة مطلوبة

# CroppedImageOnlyJPEGPNGAndWebPFormatsAreAllowed
source: Only JPEG, PNG, and WebP formats are allowed for the cropped image
ar: يُسمح فقط بصيغ JPEG و PNG و WebP للصورة المقصوصة

# AnErrorOccurredWhileEditingCoverImage
source: An error occurred while editing the cover image
ar: حدث خطأ أثناء تعديل صورة الغلاف

source: The cover image has been changed successfully
ar: تم تغيير صورة الغلاف بنجاح

source: An error occurred while processing your cover image modification request
ar: حدث خطأ أثناء معالجة طلب تعديل صورة الغلاف الخاص بك

source: An error occurred while sending the change email, please try again
ar: حدث خطأ أثناء إرسال بريد تغيير البريد الإلكتروني، يرجى المحاولة مرة أخرى

source: Change email has been sent
ar: تم إرسال بريد تغيير البريد الإلكتروني

source: Email changed successfully
ar: تم تغيير البريد الإلكتروني بنجاح

source: An error occurred during the change email process
ar: حدث خطأ أثناء عملية تغيير البريد الإلكتروني

source: Bio is required
ar: السيرة الذاتية مطلوبة

# BioSizeMustNotExceed150Characters
source: Bio must not exceed 150 characters
ar: يجب ألا تتجاوز السيرة الذاتية 150 حرفًا

source: An error occurred while changing the bio
ar: حدث خطأ أثناء تغيير السيرة الذاتية

source: Bio changed successfully
ar: تم تغيير السيرة الذاتية بنجاح

source: An error occurred while changing the name
ar: حدث خطأ أثناء تغيير الاسم

source: Name changed successfully
ar: تم تغيير الاسم بنجاح

source: Failed to delete image from Cloudinary
ar: فشل حذف الصورة من Cloudinary

source: Image has been successfully deleted
ar: تم حذف الصورة بنجاح

source: An error occurred while saving
ar: حدث خطأ أثناء الحفظ

source: An error occurred while deleting the image
ar: حدث خطأ أثناء حذف الصورة

source: Failed to delete original image from Cloudinary
ar: فشل حذف الصورة الأصلية من Cloudinary

source: Failed to delete cropped image from Cloudinary
ar: فشل حذف الصورة المقصوصة من Cloudinary

source: Failed to delete old image from Cloudinary
ar: فشل حذف الصورة القديمة من Cloudinary

source: Failed to delete old original image from Cloudinary
ar: فشل حذف الصورة الأصلية القديمة من Cloudinary

source: Failed to delete old cropped image from Cloudinary
ar: فشل حذف الصورة المقصوصة القديمة من Cloudinary

source: There is no image to delete
ar: لا توجد صورة للحذف

source: The crop data has been modified successfully
ar: تم تعديل بيانات القص بنجاح

source: An error occurred while changing the crop data
ar: حدث خطأ أثناء تغيير بيانات القص

# AnErrorOccurredWhileEditingCroppedCoverImage
source: An error occurred while editing the cropped cover image
ar: حدث خطأ أثناء تعديل صورة الغلاف المقصوصة

source: The cropped cover image has been changed successfully
ar: تم تغيير صورة الغلاف المقصوصة بنجاح

source: An error occurred while processing your cropped cover image modification request
ar: حدث خطأ أثناء معالجة طلب تعديل صورة الغلاف المقصوصة الخاص بك

# LogOutSuccessfully
source: Logged out successfully
ar: تم تسجيل الخروج بنجاح

source: An error occurred while commenting
ar: حدث خطأ أثناء إضافة التعليق

source: Comment completed successfully
ar: تم إضافة التعليق بنجاح

source: Comment not found
ar: التعليق غير موجود

source: You are not the owner of this comment or you are not the admin
ar: لست مالك هذا التعليق أو لست المسؤول

source: An error occurred while deleting the comment
ar: حدث خطأ أثناء حذف التعليق

source: The comment has been successfully deleted
ar: تم حذف التعليق بنجاح

source: An error occurred while updating the comment
ar: حدث خطأ أثناء تحديث التعليق

source: The comment has been successfully updated
ar: تم تحديث التعليق بنجاح

# YouAreAlreadyAddedLikeToThisComment
source: You have already liked this comment
ar: لقد قمت بالإعجاب بهذا التعليق مسبقًا

source: The like process for this comment failed
ar: فشلت عملية الإعجاب بهذا التعليق

source: An error occurred while adding a like to the comment
ar: حدث خطأ أثناء إضافة إعجاب للتعليق

source: The like has been added to the comment successfully
ar: تم إضافة الإعجاب للتعليق بنجاح

# YouAreNotLikedThisComment
source: You have not liked this comment
ar: أنت لم تقم بالإعجاب بهذا التعليق

source: An error occurred while removing a like from the comment
ar: حدث خطأ أثناء إزالة الإعجاب من التعليق

source: The like has been deleted from the comment successfully
ar: تم ازالة الإعجاب من التعليق بنجاح

source: Comments not found
ar: لم يتم العثور على تعليقات

source: Comments found
ar: تم العثور على تعليقات

source: Replies found
ar: تم العثور على الردود

source: Replies not found
ar: لم يتم العثور على ردود

# AnErrorOccurredWhileRepling
source: An error occurred while replying
ar: حدث خطأ أثناء إضافة الرد

source: Reply completed successfully
ar: تم إضافة الرد بنجاح

source: Reply not found
ar: الرد غير موجود

source: You are not the owner of this reply or you are not the admin
ar: لست مالك هذا الرد أو لست المسؤول

source: An error occurred while deleting the reply
ar: حدث خطأ أثناء حذف الرد

source: The reply has been successfully deleted
ar: تم حذف الرد بنجاح

source: An error occurred while updating the reply
ar: حدث خطأ أثناء تحديث الرد

source: The reply has been successfully updated
ar: تم تحديث الرد بنجاح

# YouAreAlreadyAddedLikeToThisReply
source: You have already liked this reply
ar: لقد قمت بالإعجاب بهذا الرد مسبقًا

source: The like process for this reply failed
ar: فشلت عملية الإعجاب بهذا الرد

source: An error occurred while adding a like to the reply
ar: حدث خطأ أثناء إضافة إعجاب للرد

source: The like has been added to the reply successfully
ar: تم إضافة الإعجاب للرد بنجاح

# YouAreNotLikedThisReply
source: You have not liked this reply
ar: أنت لم تقم بالإعجاب بهذا الرد

source: An error occurred while removing a like from the reply
ar: حدث خطأ أثناء إزالة الإعجاب من الرد

# AnErrorOccurredWhileRetrievingTheCategorie
source: An error occurred while retrieving the categories
ar: حدثت مشكلة أثناء الحصول على الفئات

source: The like has been deleted from the reply successfully
ar: تم حذف الإعجاب من الرد بنجاح
